src/setup_files/requestSequence.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://rice.kuali.org/kim/v2_0">
    <soapenv:Header/>
    <soapenv:Body>
        <v2:createEntity>
            <!--Optional:-->
            <v2:entity>
                <v2:principals>
                    <!--Zero or more repetitions:-->
                    <v2:principal>
                        <!--Optional:-->
                        <v2:principalId>11201</v2:principalId>
                        <!--Optional:-->
                        <v2:principalName>vinodjha</v2:principalName>
                        <!--Optional:-->
                        <v2:entityId>10083</v2:entityId>
                        <v2:active>true</v2:active>
                    </v2:principal>
                </v2:principals>

                <!--You may enter ANY elements at this point-->
            </v2:entity>
        </v2:createEntity>
    </soapenv:Body>
</soapenv:Envelope>


